In [2]:
import pandas as pd

In [3]:
data = [[1,'Tom','M',98,93,81],[2,'Harry','M',67,87,91],[3,'Sarah','F',83,78,90],[4,'Anna','F',84,86,56],[5,'Jim','M',71,83,88],[6,'Michael','M',90,91,76],[7,'Rachel','F',88,93,71],[8,'Wayne','M',90,38,73],[9,'Pam','F',99,33,96],[10,'Rajesh','M',97,79,88]]

In [4]:
df = pd.DataFrame(data,columns=['Roll No.','Name','gender','Marks1','Marks2','Marks3'])

In [5]:
df

   Roll No.     Name gender  Marks1  Marks2  Marks3
0         1      Tom      M      98      93      81
1         2    Harry      M      67      87      91
2         3    Sarah      F      83      78      90
3         4     Anna      F      84      86      56
4         5      Jim      M      71      83      88
5         6  Michael      M      90      91      76
6         7   Rachel      F      88      93      71
7         8    Wayne      M      90      38      73
8         9      Pam      F      99      33      96
9        10   Rajesh      M      97      79      88

In [6]:
dflist=["Marks1","Marks2","Marks3"]
df["Total Marks"]= df[dflist].sum(axis=1)

In [7]:
df

   Roll No.     Name gender  Marks1  Marks2  Marks3  Total Marks
0         1      Tom      M      98      93      81          272
1         2    Harry      M      67      87      91          245
2         3    Sarah      F      83      78      90          251
3         4     Anna      F      84      86      56          226
4         5      Jim      M      71      83      88          242
5         6  Michael      M      90      91      76          257
6         7   Rachel      F      88      93      71          252
7         8    Wayne      M      90      38      73          201
8         9      Pam      F      99      33      96          228
9        10   Rajesh      M      97      79      88          264

In [8]:
lowest_marks1= df["Marks1"].min(axis=0)
lowest_marks1

67

In [9]:
highest_marks2= df["Marks2"].max(axis=0)
highest_marks2

93

In [10]:
avg_marks3 = df["Marks3"].mean(axis=0)
avg_marks3

81.0

In [11]:
df["Average Marks"]=df[dflist].mean(axis=1)
high_avg = df[df["Average Marks"]==df['Average Marks'].max(axis=0)]
high_avg

   Roll No. Name gender  Marks1  Marks2  Marks3  Total Marks  Average Marks
0         1  Tom      M      98      93      81          272      90.666667

In [13]:
fail = df[df["Marks2"]<40]
fail

   Roll No.   Name gender  Marks1  Marks2  Marks3  Total Marks  Average Marks
7         8  Wayne      M      90      38      73          201           67.0
8         9    Pam      F      99      33      96          228           76.0